[{"title": "The /r/books Book Club Selection + AMA for October is \"Lakewood\" by Megan Giddings", "link": "/r/books/comments/xix7ea/the_rbooks_book_club_selection_ama_for_october_is/", "date": "il y a 23 jours", "votes": "121", "comments": "32 commentaires"}, {"title": "Literature of Croatia: October 2022", "link": "/r/books/comments/y20udu/literature_of_croatia_october_2022/", "date": "il y a 21 heures", "votes": "60", "comments": "15 commentaires"}, {"title": "Never Let Me Go is a book that I can’t stop thinking about", "link": "/r/books/comments/y2ek9g/never_let_me_go_is_a_book_that_i_cant_stop/", "date": "il y a 12 heures", "votes": "1.1k", "comments": "112 commentaires"}, {"title": "I am reading The Joy Luck Club by Amy Tan, and I want to share this quote with y’all", "link": "/r/books/comments/y2nuak/i_am_reading_the_joy_luck_club_by_amy_tan_and_i/", "date": "il y a 5 heures", "text": "I love this quote. It’s melancholy, wistful, and sets the tone and major themes for the book very well. I keep thinking about it, so I wanted to put it here, so others could read it too, and so I’ll have it written down.\n\n“Now the woman was old. And she had a daughter who grew up speaking only English and swallowing more Coca-Cola than sorrow. For a long time now the woman had wanted to give her daughter the single swan feather and tell her, ‘This feather may look worthless, but it comes from afar and carries with it all my good intentions.’ And she waited, year after year, for the day she could tell her daughter this in perfect American English.”", "votes": "161", "comments": "18 commentaires"}, {"title": "I am reading Lolita and it is a book that I don’t love nor would recommend to anyone. But it might be the best book I’ve ever read.", "link": "/r/books/comments/y26ins/i_am_reading_lolita_and_it_is_a_book_that_i_dont/", "date": "il y a 17 heures", "text": "For some context: I am around 80 pages into the book. So this opinion isn’t with the full context of the book just what I have read so far. This book beautiful and disgusting. The actual prose are jaw dropingly amazing. Nabokov writes better than any English writer in my opinion. But the writing is talking about truly repugnant things and events. “The dimmest of my pollution dreams was a thousand times more dazzling than all the adultery the most virile writer of genius or the most talented impotent might imagine”(18). A truly remarkable line talking about how the main characters desires lie in Nymphets as he calls them. The book is both so magnificent to read and makes me want to puke. The point of this was just to really put my thoughts on this book somewhere. To those reading it or have read it would love to know your viewpoint on it too.", "votes": "1.4k", "comments": "286 commentaires"}, {"title": "Anthony Bourdain and the farce of the 'unauthorized' biography (according to an 'unauthorized' biographer)", "link": "/r/books/comments/y2641h/anthony_bourdain_and_the_farce_of_the/", "date": "il y a 17 heures", "votes": "1.0k", "comments": "57 commentaires"}, {"title": "The difference in how Sex is treated in 1984 vs Brave New World.", "link": "/r/books/comments/y1t7yd/the_difference_in_how_sex_is_treated_in_1984_vs/", "date": "il y a 1 jour", "text": "I read 1984 and Brave New World as a teenager and recently reread them.\n\nI found it interesting that in these two different dystopian worlds, sex is treated entirely differently.\n\nIn 1984, the government encourages minimizing sexual activities to procreation among party members, which the author implies is a mechanism to oppress the people.\n\nIn Brave New World, the government encourages wide spread sexual activity and discourages monogamy, which the author implies a mechanism to oppress the people.\n\nHas anyone thought much about why these two authors took a completely different approach on the topic of sexuality?\n\n[Edit: discourages monogomy, not oppression*]", "votes": "4.7k", "comments": "543 commentaires"}]